Rhino.Inside.Revit API
GeometryEncoder.ToXYZ Method (Vector3f)
 Converts the specified Rhino.Geometry.Vector3f to an equivalent Autodesk.Revit.DB.XYZ.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.XYZ ToXYZ(
	this Rhino.Geometry.Vector3f vector
)
@staticmethod
def ToXYZ(
	vector: Rhino.Geometry.Vector3f
) -> Autodesk.Revit.DB.XYZ
Parameters
vector
Type: Rhino.Geometry.Vector3f
Rhino vector to convert.
Return Value
Type: Autodesk.Revit.DB.XYZ
Revit point that is equivalent to the provided Rhino vector.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Vector3f. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToXYZ(Vector3f) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.XYZ revitXYZPoint = rhinoVector3f.ToXYZ();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_xyzpoint = rhino_vector3f.ToXYZ()    # type: DB.XYZ
 Using ToXYZ(Vector3f) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.XYZ revitXYZPoint = GeometryEncoder.ToXYZ(rhinoVector3f);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_xyzpoint = GE.ToXYZ(rhino_vector3f)    # type: DB.XYZ
See Also
Reference
GeometryEncoder Class
ToXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace